# -*- coding: utf-8 -*-


class dic_relationship:
    Dependency_Syntax = {'SBV': '主谓关系',
                         'VOB': '动宾关系',
                         'IOB': '间宾关系',
                         'FOB': '前置宾语',
                         'DBL': '兼语',
                         'ATT': '定中关系',
                         'ADV': '状中结构',
                         'CMP': '动补结构',
                         'COO': '并列关系',
                         'POB': '介宾关系',
                         'LAD': '左附加关系',
                         'RAD': '右附加关系',
                         'IS': '独立结构',
                         'HED': '核心关系',
                         'WP':'WP'}
    Vocabulary = {'a': '形容词',
                  'b': '其他名词修饰语',
                  'c': '连词',
                  'd': '副词',
                  'e': '感叹',
                  'g': '词素',
                  'h': '字首',
                  'i': '成语',
                  'j': '缩写',
                  'k': '后缀',
                  'm': '数',
                  'n': '一般名词',
                  'nd': '方向名词',
                  'nh': '人名',
                  'ni': '机构名称',
                  'nl': '地点名词',
                  'ns': '地理名称',
                  'nt': '时间名词',
                  'nz': '其他专有名词',
                  'o': '象声词',
                  'p': '介词',
                  'q': '数量',
                  'r': '代词',
                  'u': '辅',
                  'v': '动词',
                  'wp': '标点',
                  'ws': '外国词',
                  'x': '非语义',
                  'z': '描述性词语'
                  }


if __name__ == '__main__':
    print(dic_relationship.Dependency_Syntax["IOB"])
